{
  "data": [
    {
      "q": "What are Web APIs in the context of JavaScript?",
      "o": [
        "Part of the JavaScript language specification",
        "APIs provided by the browser environment",
        "Third-party JavaScript libraries",
        "Node.js built-in modules"
      ],
      "a": 1,
      "explanation": "Web APIs are provided by the browser to extend JavaScript capabilities beyond the core language."
    },
    {
      "q": "Which Web API is used to store key-value data persistently in the browser?",
      "o": [
        "sessionStorage",
        "localStorage",
        "cookies",
        "cacheStorage"
      ],
      "a": 1,
      "explanation": "localStorage stores key-value pairs persistently until explicitly cleared."
    },
    {
      "q": "What is the key difference between localStorage and sessionStorage?",
      "o": [
        "localStorage is faster",
        "sessionStorage is shared across tabs",
        "localStorage persists after browser close",
        "sessionStorage supports objects"
      ],
      "a": 2,
      "explanation": "localStorage persists even after closing the browser, while sessionStorage is cleared when the tab closes."
    },
    {
      "q": "Which API is used to make HTTP requests in modern browsers?",
      "o": [
        "XMLHttpRequest",
        "fetch",
        "axios",
        "request"
      ],
      "a": 1,
      "explanation": "The Fetch API provides a modern promise-based interface for making HTTP requests."
    },
    {
      "q": "Which Web API allows scheduling code execution after a delay?",
      "o": [
        "setTimeout",
        "setInterval",
        "requestAnimationFrame",
        "All of the above"
      ],
      "a": 3,
      "explanation": "setTimeout, setInterval, and requestAnimationFrame all schedule code execution in different ways."
    },
    {
      "q": "Which API provides information about the current page URL?",
      "o": [
        "window.navigator",
        "window.location",
        "window.history",
        "document.locationBar"
      ],
      "a": 1,
      "explanation": "window.location provides information about the current URL and allows navigation."
    },
    {
      "q": "Which Web API allows navigation through the browser history?",
      "o": [
        "navigator",
        "history",
        "location",
        "session"
      ],
      "a": 1,
      "explanation": "The History API allows navigation backward and forward through the session history."
    },
    {
      "q": "Which API provides information about the user's browser and device?",
      "o": [
        "window.device",
        "window.browser",
        "navigator",
        "clientInfo"
      ],
      "a": 2,
      "explanation": "The Navigator API provides information such as user agent, platform, and online status."
    },
    {
      "q": "Which Web API is commonly used to store structured data and large objects?",
      "o": [
        "localStorage",
        "cookies",
        "IndexedDB",
        "sessionStorage"
      ],
      "a": 2,
      "explanation": "IndexedDB is designed for storing large amounts of structured data on the client side."
    },
    {
      "q": "Which Web API is primarily used for detecting user location?",
      "o": [
        "Navigator API",
        "Geolocation API",
        "Location API",
        "Maps API"
      ],
      "a": 1,
      "explanation": "The Geolocation API allows access to the user's geographic location with permission."
    }
  ]
}
