{
  "data": [
    {
      "q": "What does the 'Largest Contentful Paint' (LCP) metric measure in Web Vitals?",
      "o": [
        "The time it takes for the entire page to finish downloading",
        "The render time of the largest image or text block visible within the viewport",
        "The delay between a user's first interaction and the browser's response",
        "The total number of bytes transferred for the main document"
      ],
      "a": 1,
      "e": "LCP is a Core Web Vital that measures perceived load speed, marking the point in the page load timeline when the main content has likely loaded."
    },
    {
      "q": "Which metric is used to quantify visual stability and prevent 'layout shifts' while a page is loading?",
      "o": [
        "First Input Delay (FID)",
        "Cumulative Layout Shift (CLS)",
        "Time to Interactive (TTI)",
        "First Contentful Paint (FCP)"
      ],
      "a": 1,
      "e": "CLS measures the sum total of all individual layout shift scores for every unexpected layout shift that occurs during the entire lifespan of the page."
    },
    {
      "q": "What is 'Code Splitting'?",
      "o": [
        "Breaking a single JavaScript bundle into smaller chunks that can be loaded on demand",
        "Dividing the backend and frontend into different repositories",
        "Writing CSS and HTML in separate files",
        "Duplicating code to ensure redundancy"
      ],
      "a": 0,
      "e": "Code splitting allows you to 'lazy load' parts of the application only when the user needs them, significantly reducing the initial load time."
    },
    {
      "q": "How does the 'Image Lazy Loading' attribute (`loading=\"lazy\"`) improve performance?",
      "o": [
        "It compresses images automatically",
        "It delays the loading of images until they are close to the user's viewport",
        "It converts images to the WebP format",
        "It hides images from screen readers"
      ],
      "a": 1,
      "e": "Lazy loading saves bandwidth and reduces initial page weight by not loading images that the user might never scroll to see."
    },
    {
      "q": "What is the primary purpose of a 'Content Delivery Network' (CDN)?",
      "o": [
        "To host the application's database",
        "To serve static assets from servers physically closer to the user to reduce latency",
        "To encrypt user passwords",
        "To provide a domain name for the website"
      ],
      "a": 1,
      "e": "CDNs store copies of your files (images, JS, CSS) in multiple data centers worldwide, shortening the distance data travels to reach the user."
    },
    {
      "q": "Which technique involves rendering the initial HTML on the server instead of the client-side browser?",
      "o": [
        "Single Page Application (SPA)",
        "Server-Side Rendering (SSR)",
        "Client-Side Hydration",
        "Dynamic Importing"
      ],
      "a": 1,
      "e": "SSR provides a faster 'First Contentful Paint' and better SEO because the browser receives a fully-formed HTML document rather than an empty div."
    },
    {
      "q": "What does 'Minification' do to CSS and JavaScript files?",
      "o": [
        "It converts the code into a different programming language",
        "It removes whitespace, comments, and shortens variable names to reduce file size",
        "It adds comments to explain the code's logic",
        "It encrypts the code to prevent theft"
      ],
      "a": 1,
      "e": "Minification reduces the number of bytes that need to be sent over the network without changing the functionality of the code."
    },
    {
      "q": "In the browser's Rendering Pipeline, which step follows the creation of the 'Render Tree'?",
      "o": [
        "Painting",
        "Layout (Reflow)",
        "Composition",
        "Parsing"
      ],
      "a": 1,
      "e": "After the Render Tree is built, the browser performs 'Layout' to calculate the exact geometry (position and size) of each visible element."
    },
    {
      "q": "What is the benefit of using the `defer` attribute on a `<script>` tag?",
      "o": [
        "It makes the script load synchronously",
        "It executes the script immediately upon download",
        "It allows the HTML to continue parsing while the script downloads, executing only after parsing is complete",
        "It prevents the script from being cached"
      ],
      "a": 2,
      "e": "Unlike `async`, `defer` ensures that scripts are executed in order and only after the DOM is fully parsed, preventing 'render-blocking' behavior."
    },
    {
      "q": "Which HTTP version introduced 'Multiplexing', allowing multiple requests to be sent over a single TCP connection?",
      "o": [
        "HTTP/1.0",
        "HTTP/1.1",
        "HTTP/2",
        "HTTP/3"
      ],
      "a": 2,
      "e": "HTTP/2 multiplexing significantly reduces latency by allowing the browser to request many files simultaneously without needing multiple separate connections."
    },
    {
      "q": "What is a 'Brotli' or 'Gzip' compression?",
      "o": [
        "A type of image format",
        "Algorithms used to compress text-based assets (HTML, CSS, JS) during transfer",
        "A CSS framework",
        "A tool for minifying JavaScript"
      ],
      "a": 1,
      "e": "These compression algorithms reduce the transfer size of your assets. Brotli generally offers better compression ratios than Gzip for web content."
    },
    {
      "q": "What is the 'Critical CSS' technique?",
      "o": [
        "Using `!important` on every CSS rule",
        "Inlining only the CSS required to style the 'above-the-fold' content to speed up initial render",
        "Removing all unused CSS classes",
        "Combining all CSS files into one large file"
      ],
      "a": 1,
      "e": "By inlining critical CSS, the browser can start rendering the visible part of the page immediately without waiting for an external stylesheet to download."
    }
  ]
}